title: Detect AWS Secrets Manager GetSecretValue Operation from CloudShell
id: 8abab6d1-ac89-4c51-a038-80c565f2c5da
status: experimental
description: Detects the use of the AWS Secrets Manager GetSecretValue operation from CloudShell, which may indicate an attempt to access sensitive information.
references:
  - https://permiso.io/blog/lucr-3-scattered-spider-getting-saas-y-in-the-cloud
author: System Two Security
date: 2024/06/25
tags:
  - attack.credential_access
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    eventName: GetSecretValue
    eventSource: secretsmanager.amazonaws.com
    userAgent|contains: CloudShell
  condition: selection
falsepositives:
  - Legitimate use of CloudShell by authorized personnel to access Secrets Manager.
level: high
