title: Detection of smbpasswd.py Script Execution
id: 87960f9f-6b75-4837-8da1-d18f33326059
status: experimental
description: Detects the execution of the smbpasswd.py script which is commonly used in attacks to change passwords on SMB servers.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/25/octo-tempest-crosses-boundaries-to-facilitate-extortion-encryption-and-destruction
author: System Two Security
date: 2024/06/25
tags:
  - attack.credential_access
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    CommandLine|contains: smbpasswd.py
  condition: selection
falsepositives:
  - Legitimate use of smbpasswd.py by system administrators
level: high
