title: Detection of LINPeas Local Privilege Escalation Enumeration Tool Log File
id: 408bc3de-64da-4111-b956-35da08950c7e
status: experimental
description: Detects the creation or modification of linpeas.log, which is a log file generated by the LINPeas Local Privilege Escalation Enumeration tool.
references:
  - https://www.crowdstrike.com/blog/analysis-of-intrusion-campaign-targeting-telecom-and-bpo-companies
author: System Two Security
date: 2024/07/02
tags:
  - attack.privilege_escalation
logsource:
  product: linux
  category: file_event
detection:
  selection:
    TargetFilename|endswith: linpeas.log
  condition: selection
falsepositives:
  - Legitimate use of LINPeas tool by system administrators for auditing and troubleshooting.
level: high
