title: Detection of LaZagne Credential Dumping Tool
id: 5d13b84d-80f4-4b17-9663-b3a1b6bb7bac
status: experimental
description: Detects the execution of LaZagne, an open-source application used to retrieve lots of passwords stored on a local computer.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/25/octo-tempest-crosses-boundaries-to-facilitate-extortion-encryption-and-destruction
author: System Two Security
date: 2024/06/25
tags:
  - attack.t1003
  - attack.credential_access
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
      - lazagne.exe
      - all
  condition: selection
falsepositives:
  - Legitimate use of LaZagne by system administrators for password recovery
level: high
