title: Detection of Malicious Runscript Commands in CrowdStrike Falcon RTR
id: 321c7c7f-2364-4abc-ab97-784b9956e74d
status: experimental
description: Detects the use of the runscript command with various curl commands in CrowdStrike Falcon RTR which may indicate an adversary's attempt to execute commands within the Real Time Response module for reconnaissance or command execution.
references:
  - https://cloud.google.com/blog/topics/threat-intelligence/unc3944-targets-saas-applications
author: System Two Security
date: 2024/06/25
tags:
  - attack.exfiltration
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
      - -Timeout=
      - runscript -raw=
      - curl
  condition: selection
falsepositives:
  - Legitimate administrative activities that use runscript commands with curl for maintenance or troubleshooting.
level: high
