title: Detection of Mimikatz Activity
id: bedb3aee-439a-4eeb-bb0a-f23cf80aacc1
status: experimental
description: Detects command line usage and process creation events related to Mimikatz, an in-memory credential dumper.
references:
  - https://cloud.google.com/blog/topics/threat-intelligence/unc3944-targets-saas-applications
author: System Two Security
date: 2024/06/25
tags:
  - attack.privilege_escalation
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
      - sekurlsa::logonpasswords
      - sekurlsa::tickets
      - 'lsadump::'
      - privilege::debug
  condition: selection
falsepositives:
  - Penetration testing or security assessments using Mimikatz
  - False positives are generally rare and should be investigated
level: critical
