title: Detection of MAS_AIO and privacy-script.bat Execution
id: d1cccfd4-1a33-47b4-9d56-f98052130c30
status: experimental
description: Detects the execution of MAS_AIO and privacy-script.bat utilities which are known to deactivate Microsoft Defender and Windows telemetry, indicating a potential compromise of the system.
references:
  - https://cloud.google.com/blog/topics/threat-intelligence/unc3944-targets-saas-applications
author: System Two Security
date: 2024/06/25
tags:
  - attack.defense_evasion
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
      - MAS_AIO
      - privacy-script.bat
  condition: selection
falsepositives:
  - Legitimate use of MAS_AIO or privacy-script.bat by system administrators for maintenance or troubleshooting purposes.
level: high
